{
  ".authorMsg": "",
  "! :)": "",
  "(Dualsense) Will updating the firmware reset calibration?": "(Dualsense) Сбросит ли обновление прошивки калибровку?",
  ", it was discovered that there exist some undocumented commands on DualShock controllers that can be sent via USB and are used during factory assembly process. If these commands are sent, the controller starts the recalibration of analog sticks.": ", было обнаружено, что существуют некоторые недокументированные команды для контроллеров DualShock, которые можно отправить через USB и которые используются в процессе заводской сборки. Если эти команды отправлены, контроллер запускает повторную калибровку аналоговых стиков.",
  ", to help more people like you!": ", чтобы помочь большему количеству людей, как вы!",
  "10x zoom": "10-кратное увеличение",
  "<b>Externally</b>: by applying +1.8V directly to the visible test point without opening the controller.": "<b>Внешне</b>: путем подачи +1.8В напрямую на видимую контрольную точку, не вскрывая контроллер.",
  "<b>Internally</b>: by soldering a wire from a +1.8V source to the write-protect TP.": "<b>Внутренне</b>: путем припайки провода от источника +1.8В к контрольной точке защиты от записи.",
  "<p>Support for PS VR2 controllers is <b>minimal and highly experimental</b>.</p><p>I currently don't own these controllers, so I cannot verify the calibration process myself.</p><p>If you'd like to help improve full support, you can contribute with a donation or even send the controllers for testing.</p><p>Feel free to contact me on Discord (the_al) or by email at ds4@the.al .</p><br><p>Thank you for your support!</p>": "<p>Поддержка контроллеров PS VR2 является <b>минимальной и сильно экспериментальной</b>.</p><p>В настоящее время у меня нет этих контроллеров, поэтому я не могу сам проверить процесс калибровки.</p><p>Если вы хотите помочь улучшить полную поддержку, вы можете внести вклад пожертвованием или даже отправить контроллеры для тестирования.</p><p>Не стесняйтесь связаться со мной в Discord (the_al) или по электронной почте ds4@the.al .</p><br><p>Спасибо за вашу поддержку!</p>",
  "<strong>Average circularity error:</strong> smaller is not always better! Aim for 7-9 %.": "<strong>Средняя ошибка округлости:</strong> меньше - не всегда лучше! Стремитесь к 7-9 %.",
  "A reboot is needed to continue using this DualSense Edge. Please disconnect and reconnect your controller.": "Для продолжения использования DualSense Edge требуется перезагрузка. Пожалуйста, отключите и снова подключите контроллер.",
  "Adaptive triggers are only supported on DualSense controllers": "Адаптивные триггеры поддерживаются только на контроллерах DualSense",
  "Add support for recalibrating IMUs.": "Добавить поддержку перекалибровки ИМС (IMU).",
  "Add test": "Добавить тест",
  "Additionally, explore the possibility of reviving non-functioning DualShock controllers (further discussion available on Discord for interested parties).": "Кроме того, изучить возможность восстановления нерабочих контроллеров DualShock (дальнейшее обсуждение доступно в Discord для заинтересованных лиц).",
  "After range calibration, joysticks always go in corners.": "После калибровки диапазона стики всегда уходят в углы.",
  "After they have been replaced, this utility can be used to calibrate the controller to work with the new joysticks.": "После их замены эта утилита может быть использована для калибровки контроллера для работы с новыми джойстиками.",
  "Aim for a circularity error of around 7-9 % for the best playing experience.": "Стремитесь к ошибке округлости около 7-9% для наилучшего игрового опыта.",
  "Battery Barcode": "Штрих-код батареи",
  "Battery level is low. Tests may fail due to the controller being in power saving mode.": "Низкий уровень заряда батареи. Тесты могут завершиться неудачей из-за перехода контроллера в режим энергосбережения.",
  "Be gentle to avoid damage.": "Будьте осторожны, чтобы избежать повреждений.",
  "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "Прежде чем делать постоянную калибровку, попробуйте временную, чтобы убедиться, что всё работает хорошо.",
  "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.": "За кулисами, этот сайт - кульминация одного года упорной работы по реверс-инжинирингу контроллеров DualShock для развлечения/хобби от случайного парня в интернете.",
  "Blow gently into the controller's microphone. You should see the audio level indicator respond.": "Аккуратно подуйте в микрофон контроллера. Вы должны увидеть реакцию индикатора уровня звука.",
  "Bluetooth Address": "Bluetooth-адрес",
  "Board Model": "Модель платы",
  "Build Date": "Дата сборки",
  "Calibrate stick center": "Калибровка центра стика",
  "Calibrate stick range": "Калибровка диапазона стика",
  "Calibrating without replacing the joysticks may help temporarily, but it may also make the problem worse, with no way to undo it.": "Калибровка без замены джойстиков может временно помочь, но также может усугубить проблему без возможности отмены.",
  "Calibration": "Калибровка",
  "Calibration History": "История калибровок",
  "Calibration completed successfully!": "Калибровка успешно завершена!",
  "Calibration is being stored in the stick modules.": "Калибровка сохраняется в модулях стиков.",
  "Can I reset a permanent calibration to previous calibration?": "Могу ли я сбросить постоянную калибровку к предыдущей калибровке?",
  "Can you overwrite a permanent calibration?": "Можно ли перезаписать постоянную калибровку?",
  "Cancel": "Отмена",
  "Cannot copy text to the clipboard:": "Не удалось скопировать текст в буфер обмена:",
  "Cannot lock": "Не удалось заблокировать",
  "Cannot read module barcodes": "Не удалось прочитать штрих-коды модулей",
  "Cannot store data into": "Не удалось сохранить данные в",
  "Cannot unlock": "Не удалось разблокировать",
  "Center": "Центр",
  "Center (L1)": "Центр (L1)",
  "Changes saved successfully": "Изменения успешно сохранены",
  "Check circularity": "Проверить округлость",
  "Cheers!": "Удачи!",
  "Circularity": "Округлость",
  "Circularity (R1)": "Округлость (R1)",
  "Clear All": "Очистить всё",
  "Click \"Test Speaker\" to listen for the tone through the headphones": "Нажмите \"Тест динамика\", чтобы прослушать тон через наушники",
  "Close": "Закрыть",
  "Color": "Цвет",
  "Completed": "Завершено",
  "Connect": "Подключить",
  "Connected invalid device": "Подключено недопустимое устройство",
  "Connected to:": "Подключено к:",
  "Consider making a": "Подумайте о том, чтобы сделать",
  "Controller Info": "Информация о контроллере",
  "Controller does not support adaptive trigger control": "Контроллер не поддерживает управление адаптивными триггерами",
  "Current": "Текущий",
  "Debug": "Отладка",
  "Debug Info": "Информация для отладки",
  "Debug buttons": "Кнопки отладки",
  "Delete": "Удалить",
  "Delete all calibration history for this controller? This cannot be undone.": "Удалить всю историю калибровок для этого контроллера? Это действие необратимо.",
  "Delete this calibration entry?": "Удалить эту запись калибровки?",
  "Device Type": "Тип устройства",
  "Disconnect": "Отключить",
  "Do you have any suggestion or issue? Drop me a message via email or discord.": "Есть предложения или проблемы? Оставьте мне сообщение по электронной почте или в Discord.",
  "Does the calibration remain effective during gameplay on PS4/PS5?": "Остаётся ли калибровка эффективной во время игры на PS4/PS5?",
  "Does this software resolve stickdrift?": "Устраняет ли это программное обеспечение дрифт стиков?",
  "Does this website detect if a controller is a clone?": "Определяет ли этот сайт, является ли контроллер клоном?",
  "Don't show again": "Больше не показывать",
  "Done": "Готово",
  "Drift is caused by mechanical parts in the joystick being worn out, and they need to be replaced to fix the drift.": "Дрифт вызван износом механических частей джойстика, и для его устранения их необходимо заменить.",
  "DualSense Edge": "DualSense Edge",
  "DualSense Edge Calibration": "Калибровка DualSense Edge",
  "DualShock 3": "DualShock 3",
  "DualShock Calibration GUI": "Графический интерфейс калибровки DualShock",
  "Each of these tasks presents both immense interest and significant time investment. To provide context, supporting a new controller typically demands 6-12 months of full-time research, alongside a stroke of good fortune.": "Каждая из этих задач представляет как огромный интерес, так и значительные временные затраты. Для справки: поддержка нового контроллера обычно требует 6-12 месяцев полного рабочего дня исследований, наряду с долей удачи.",
  "Enhance user interface (e.g. provide additional controller information)": "Улучшить пользовательский интерфейс (например, предоставить дополнительную информацию о контроллере)",
  "Error": "Ошибка",
  "Error while saving changes": "Ошибка при сохранении изменений",
  "FW Build Date": "Дата сборки прошивки",
  "FW Series": "Серия прошивки",
  "FW Type": "Тип прошивки",
  "FW Update": "Обновление прошивки",
  "FW Update Info": "Информация об обновлении прошивки",
  "FW Version": "Версия прошивки",
  "Fail": "Неудача",
  "Failed": "Неудачно",
  "Failed to connect to device": "Не удалось подключиться к устройству",
  "Failed to disable adaptive trigger": "Не удалось отключить адаптивный триггер",
  "Failed to set speaker tone": "Не удалось установить тон динамика",
  "Failed to set vibration": "Не удалось установить вибрацию",
  "Feel for vibration in the controller.": "Почувствуйте вибрацию в контроллере.",
  "Finetune stick calibration": "Точная настройка калибровки стика",
  "Firefox is supported with the WebHID extension installed.": "Firefox поддерживается при установленном расширении WebHID.",
  "For more info or help, feel free to reach out on Discord.": "Для получения дополнительной информации или помощи, не стесняйтесь обращаться в Discord.",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "HW Model": "Модель аппаратной части",
  "HW Version": "Версия аппаратной части",
  "Hardware": "Аппаратное обеспечение",
  "Have a nice day :)": "Хорошего дня :)",
  "Hi, thank you for using this software.": "Привет, спасибо за использование этого программного обеспечения.",
  "How does it work?": "Как это работает?",
  "I have noticed some controllers out of the box have worse factory calibration than if I would recalibrate them. Especially true for circularity of SCUF controllers with a unique shell.": "Я заметил, что некоторые контроллеры из коробки имеют худшую заводскую калибровку, чем если бы я их перекалибровал. Особенно это касается округлости контроллеров SCUF с уникальным корпусом.",
  "I love this service, it helped me! How can I contribute?": "Мне нравится этот сервис, он помог мне! Как я могу внести свой вклад?",
  "I maintain two separate to-do lists for this project, although the priority has yet to be established.": "Я веду два отдельных списка задач для этого проекта, хотя приоритеты ещё не установлены.",
  "I'm glad to hear that you found this helpful! If you're interested in contributing, here are a few ways you can help me:": "Я рад слышать, что вы нашли это полезным! Если вы заинтересованы в помощи, вот несколько способов, как вы можете мне помочь:",
  "If the calibration is not stored permanently, please double-check the wirings of the hardware mod.": "Если калибровка не сохраняется постоянно, пожалуйста, дважды проверьте соединения аппаратной модификации.",
  "If you want to extend this detection functionality to DualSense, please ship me a fake DualSense and you'll see it in few weeks.": "Если вы хотите расширить эту функцию обнаружения на DualSense, пожалуйста, пришлите мне поддельный DualSense, и вы увидите результат через несколько недель.",
  "If you're finding it helpful and you want to support my efforts, feel free to": "Если вы находите это полезным и хотите поддержать мои усилия, не стесняйтесь",
  "Implement calibration of L2/R2 triggers.": "Реализовать калибровку триггеров L2/R2.",
  "Improve detection of clones, particularly beneficial for those seeking to purchase used controllers with assurance of authenticity.": "Улучшить обнаружение клонов, что особенно полезно для тех, кто хочет купить подержанные контроллеры с гарантией подлинности.",
  "Increase non-circularity": "Увеличить неокруглость",
  "Info": "Информация",
  "Instructions": "Инструкции",
  "Is this an officially endorsed service?": "Является ли это официально одобренным сервисом?",
  "It appears the latest joystick calibration has not been saved.": "Похоже, последняя калибровка джойстика не была сохранена.",
  "Joystick Info": "Информация о джойстике",
  "Just few things to know before you can start:": "Всего несколько вещей, которые нужно знать перед началом:",
  "Keep rotating the sticks even if you see no progress!": "Продолжайте вращать стики, даже если не видите прогресса!",
  "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "Держите внутреннюю батарею контроллера подключенной и убедитесь, что она хорошо заряжена. Если батарея сядет во время операций, контроллер будет поврежден и станет непригодным для использования.",
  "Last connected": "Последнее подключение",
  "Learn more...": "Узнать больше...",
  "Left Module Barcode": "Штрих-код левого модуля",
  "Left stick": "Левый стик",
  "Listen for a tone from the controller speaker.": "Прослушайте тон из динамика контроллера.",
  "Long-press [circle] to skip ahead.": "Долгое нажатие [круга], чтобы пропустить вперёд.",
  "MCU Unique ID": "Уникальный ID MCU",
  "Make sure to touch the edges of the joystick frame and rotate slowly, preferably in each direction - clockwise and anti-clockwise.": "Убедитесь, что вы касаетесь краёв рамки джойстика и вращаете медленно, желательно в каждом направлении - по часовой стрелке и против.",
  "Microphone Level:": "Уровень микрофона:",
  "More details and images": "Больше подробностей и изображений",
  "Move the stick to select it for tuning, then without touching the stick use the D-pad buttons to adjust the center point. Flick it and adjust it again if it is off center or flickers.": "Переместите стик, чтобы выбрать его для настройки, затем, не касаясь стика, используйте кнопки D-pad для регулировки центральной точки. Дёрните его и снова отрегулируйте, если он смещён от центра или мерцает.",
  "NVS Lock failed": "Не удалось заблокировать NVS",
  "NVS Status": "Статус NVS",
  "NVS Unlock failed": "Не удалось разблокировать NVS",
  "NVS lock": "Блокировка NVS",
  "NVS unlock": "Разблокировка NVS",
  "Next": "Далее",
  "No controller connected": "Контроллер не подключен",
  "No saved calibrations found.": "Сохранённые калибровки не найдены.",
  "No tests completed yet.": "Тесты ещё не завершены.",
  "No, this service is simply a creation by a DualShock enthusiast.": "Нет, этот сервис - просто творение энтузиаста DualShock.",
  "No.": "Нет.",
  "Normal": "Обычный",
  "Not tested": "Не тестировалось",
  "Only after you have done that, you click on \"Done\".": "Только после того, как вы это сделаете, нажмите \"Готово\".",
  "PCBA ID": "ID печатной платы (PCBA)",
  "Pass": "Успех",
  "Passed": "Успешно",
  "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until it is completed.": "Пожалуйста, имейте в виду, что <i>после запуска калибровку нельзя отменить</i>. Не закрывайте эту страницу и не отключайте контроллер до её завершения.",
  "Please connect a DualShock 4, a DualSense, DualSense Edge or VR2 controller to your computer and press Connect.": "Пожалуйста, подключите DualShock 4, DualSense, DualSense Edge или контроллер VR2 к компьютеру и нажмите \"Подключить\".",
  "Please connect only one controller at time.": "Пожалуйста, подключайте только один контроллер за раз.",
  "Please do not close this window and do not disconnect your controller. ": "Пожалуйста, не закрывайте это окно и не отключайте контроллер.",
  "Please move both sticks to the <b>bottom-left corner</b> and release them.": "Пожалуйста, переместите оба стика в <b>нижний левый угол</b> и отпустите их.",
  "Please move both sticks to the <b>bottom-right corner</b> and release them.": "Пожалуйста, переместите оба стика в <b>нижний правый угол</b> и отпустите их.",
  "Please move both sticks to the <b>top-left corner</b> and release them.": "Пожалуйста, переместите оба стика в <b>верхний левый угол</b> и отпустите их.",
  "Please move both sticks to the <b>top-right corner</b> and release them.": "Пожалуйста, переместите оба стика в <b>верхний правый угол</b> и отпустите их.",
  "Please note: the stick modules on the DS Edge <b>cannot be calibrated via software alone</b>.": "Обратите внимание: модули стиков на DS Edge <b>нельзя откалибровать только с помощью программного обеспечения</b>.",
  "Please read the instructions.": "Пожалуйста, прочитайте инструкции.",
  "Please release the stick to center position before adjusting with D-pad buttons.": "Пожалуйста, верните стик в центральное положение перед регулировкой кнопками D-pad.",
  "Please update the firmware and try again.": "Пожалуйста, обновите прошивку и попробуйте снова.",
  "Please use a web browser with WebHID support (e.g. Google Chrome or Microsoft Edge) on a PC or Mac.": "Пожалуйста, используйте веб-браузер с поддержкой WebHID (например, Google Chrome или Microsoft Edge) на ПК или Mac.",
  "Plug in headphones to the 3.5mm jack": "Подключите наушники к разъёму 3.5 мм",
  "Press <b>Start</b> to begin calibration.": "Нажмите <b>Старт</b>, чтобы начать калибровку.",
  "Press L2 and R2 triggers to feel the trigger resistance.": "Нажмите на триггеры L2 и R2, чтобы почувствовать сопротивление триггеров.",
  "Press [circle] to close, or [square] to start over": "Нажмите [круг], чтобы закрыть, или [квадрат], чтобы начать заново",
  "Press [square] to Pass, [cross] to Fail, or [circle] to skip.": "Нажмите [квадрат] для успеха, [крест] для неудачи или [круг], чтобы пропустить.",
  "Press [square] to begin or [circle] to close": "Нажмите [квадрат], чтобы начать, или [круг], чтобы закрыть",
  "Press [triangle] to go back.": "Нажмите [треугольник], чтобы вернуться назад.",
  "Press each button until they turn green.": "Нажимайте каждую кнопку, пока они не станут зелёными.",
  "Press the D-pad or face buttons in the direction you want the stick position to move.": "Нажимайте кнопки D-pad или лицевые кнопки в направлении, в котором вы хотите сдвинуть положение стика.",
  "Progress": "Прогресс",
  "Push the stick straight up/down/left/right as far as possible.": "Нажмите стик прямо вверх/вниз/влево/вправо как можно дальше.",
  "Query NVS status": "Запрос статуса NVS",
  "Quick Test": "Быстрый тест",
  "Quick calibrate": "Быстрая калибровка",
  "Range calibration": "Калибровка диапазона",
  "Range calibration appears to have failed. Please try again and make sure you rotate the sticks.": "Калибровка диапазона, похоже, не удалась. Пожалуйста, попробуйте снова и убедитесь, что вращаете стики.",
  "Range calibration completed": "Калибровка диапазона завершена",
  "Range calibration failed": "Калибровка диапазона не удалась",
  "Reboot controller": "Перезагрузить контроллер",
  "Recentering the controller sticks.": "Перецентровка стиков контроллера.",
  "Repeat": "Повторить",
  "Restart": "Перезапустить",
  "Restore": "Восстановить",
  "Restore calibration": "Восстановить калибровку",
  "Right Module Barcode": "Штрих-код правого модуля",
  "Right stick": "Правый стик",
  "Rotate the sticks slowly at least 2 times in one direction and 2 times in the other direction to cover the whole range.": "Медленно вращайте стики не менее 2 раз в одном направлении и 2 раз в другом, чтобы охватить весь диапазон.",
  "Run through these tests to verify your controller's functionality.": "Пройдите эти тесты, чтобы проверить функциональность вашего контроллера.",
  "SBL FW Version": "Версия прошивки SBL",
  "SW Version": "Версия ПО",
  "Save changes permanently": "Сохранить изменения навсегда",
  "Sections below are not useful, just some debug infos or manual commands": "Разделы ниже не являются полезными, это просто некоторая информация для отладки или ручные команды",
  "Serial Number": "Серийный номер",
  "Ship me a controller you would love to add (send me an email for organization).": "Пришлите мне контроллер, который вы хотели бы добавить (отправьте мне email для организации).",
  "Show all": "Показать всё",
  "Show raw numbers": "Показать исходные числа",
  "Software": "Программное обеспечение",
  "Sony controllers come from the factory calibrated to have an average circularity error of nearly 10 %, and this is now what games expect. Too perfect circularity can make movements and aim feel stiff and unresponsive in some games.": "Контроллеры Sony поставляются с завода откалиброванными на среднюю ошибку округлости около 10%, и именно этого теперь ожидают игры. Слишком идеальная округлость может сделать движения и прицеливание жёсткими и неотзывчивыми в некоторых играх.",
  "Spider FW Version": "Версия прошивки Spider",
  "Step 1": "Шаг 1",
  "Step 2": "Шаг 2",
  "Step 3": "Шаг 3",
  "Step 4": "Шаг 4",
  "Step size": "Размер шага",
  "Stick calibration completed": "Калибровка стика завершена",
  "Stick calibration failed": "Калибровка стика не удалась",
  "Stick center calibration": "Калибровка центра стика",
  "Stickdrift is caused by a physical defect; namely dirt, worn potentiometer or in some cases a worn spring.": "Дрифт стиков вызван физическим дефектом: а именно грязью, изношенным потенциометром или в некоторых случаях изношенной пружиной.",
  "Storing calibration...": "Сохранение калибровки...",
  "Support for calibrating DualSense Edge stick modules is now available as an <b>experimental feature</b>.": "Поддержка калибровки модулей стиков DualSense Edge теперь доступна как <b>экспериментальная функция</b>.",
  "Support this project": "Поддержать этот проект",
  "Test Speaker": "Тест динамика",
  "Test Summary": "Итог тестов",
  "Test all buttons, or long-press [square] to Pass and [cross] to Fail, or [circle] to skip.": "Протестируйте все кнопки или долго нажмите [квадрат] для успеха и [крест] для неудачи, или [круг], чтобы пропустить.",
  "The <b>Done</b> button will unlock after at most 15 seconds. If you press <b>Done</b> without rotating the sticks, the calibration will be incomplete and you will need to repeat it.": "Кнопка <b>Готово</b> станет активной максимум через 15 секунд. Если вы нажмёте <b>Готово</b>, не вращая стики, калибровка будет неполной, и вам нужно будет повторить её.",
  "The calibration was restored successfully! Remember to save the changes in order not to loose them when the controller is rebooted.": "Калибровка успешно восстановлена! Не забудьте сохранить изменения, чтобы не потерять их при перезагрузке контроллера.",
  "The controller is now sampling data!": "Контроллер теперь собирает данные!",
  "The device appears to be a clone. All calibration functionality is disabled.": "Устройство, похоже, является клоном. Вся функциональность калибровки отключена.",
  "The device is connected via Bluetooth. Disconnect and reconnect using a USB cable instead.": "Устройство подключено через Bluetooth. Отключите и снова подключите, используя вместо этого USB-кабель.",
  "The first list is about enhancing support for DualShock4 and DualSense controllers:": "Первый список посвящён улучшению поддержки контроллеров DualShock4 и DualSense:",
  "The item has been copied to the clipboard.": "Элемент скопирован в буфер обмена.",
  "The second list contains new controllers I aim to support:": "Второй список содержит новые контроллеры, которые я намерен поддерживать:",
  "This DualSense controller has outdated firmware.": "У этого контроллера DualSense устаревшая прошивка.",
  "This controller has unsaved changes that will be lost when the controller is rebooted.": "В этом контроллере есть несохранённые изменения, которые будут потеряны при перезагрузке контроллера.",
  "This involves temporarily disabling write protection by applying <b>+1.8V</b> to a specific test point on each module.": "Это предполагает временное отключение защиты от записи путём подачи <b>+1.8В</b> на определённую контрольную точку на каждом модуле.",
  "This is only for advanced users. If you're not sure what you're doing, please do not attempt it.": "Это только для опытных пользователей. Если вы не уверены в том, что делаете, пожалуйста, не пытайтесь.",
  "This issue happens because you have clicked \"Done\" immediately after starting a range calibration.": "Эта проблема возникает из-за того, что вы нажали \"Готово\" сразу после начала калибровки диапазона.",
  "This service is provided without warranty. Use at your own risk.": "Этот сервис предоставляется без каких-либо гарантий. Используйте на свой страх и риск.",
  "This software will not fix stick drift on its own if you already experience that. What it will help with, is ensuring the new joystick(s) will function properly after replacing the old one(s) to work well with.": "Это программное обеспечение само по себе не устранит дрифт стиков, если вы уже с этим столкнулись. Оно поможет убедиться, что новый джойстик(и) будет правильно функционировать после замены старого(ых).",
  "This test checks all controller buttons by requiring you to press each button up to three times.": "Этот тест проверяет все кнопки контроллера, требуя нажать каждую кнопку до трёх раз.",
  "This test checks the headphone jack functionality.": "Этот тест проверяет функциональность разъёма для наушников.",
  "This test checks the reliability of the USB port.": "Этот тест проверяет надёжность USB-порта.",
  "This test will activate the controller's vibration motors, first the heavy one, and then the light one.": "Этот тест активирует моторы вибрации контроллера: сначала тяжёлый, затем лёгкий.",
  "This test will cycle through red, green, and blue colors on the controller lightbar, animate the player indicator lights, and flash the mute button.": "В этом тесте световая панель контроллера будет циклически менять цвета (красный, зелёный, синий), анимировать индикаторы игроков и мигать кнопкой отключения звука.",
  "This test will enable heavy resistance on both L2 and R2 triggers.": "Этот тест включит сильное сопротивление на обоих триггерах L2 и R2.",
  "This test will monitor the controller's microphone input levels.": "Этот тест будет отслеживать уровни ввода с микрофона контроллера.",
  "This test will play a tone through the controller's built-in speaker.": "Этот тест воспроизведёт тон через встроенный динамик контроллера.",
  "This tool will guide you in re-centering the analog sticks of your controller. It consists of four steps: you will be asked to move both sticks in a direction and release them.": "Этот инструмент поможет вам перецентровать аналоговые стики вашего контроллера. Он состоит из четырёх шагов: вам будет предложено переместить оба стика в направлении и отпустить их.",
  "This utility cannot fix stick drift.": "Эта утилита не может исправить дрифт стиков.",
  "This website is not affiliated with Sony, PlayStation &amp; co.": "Этот сайт не связан с Sony, PlayStation и т.д.",
  "This website uses analytics to improve the service.": "Этот сайт использует аналитику для улучшения сервиса.",
  "Through": "Через",
  "To store a custom calibration on the stick's internal memory, a <b>hardware modification</b> is required.": "Для сохранения пользовательской калибровки во внутренней памяти стика требуется <b>аппаратная модификация</b>.",
  "Touchpad FW Version": "Версия прошивки тачпада",
  "Touchpad ID": "ID тачпада",
  "Translate this website in your language": "Перевести этот сайт на ваш язык",
  "Understood": "Понятно",
  "Unfortunately, the clones cannot be calibrated anyway, because they only clone the behavior of a DualShock4 during normal gameplay, not all the undocumented functionalities.": "К сожалению, клоны всё равно нельзя откалибровать, потому что они клонируют только поведение DualShock4 во время обычной игры, а не все недокументированные функции.",
  "Unknown": "Неизвестно",
  "Unsupported browser.": "Неподдерживаемый браузер.",
  "Use expert mode": "Использовать экспертный режим",
  "Use four-step calibration": "Использовать четырёхшаговую калибровку",
  "Use normal mode": "Использовать обычный режим",
  "Use quick calibration": "Использовать быструю калибровку",
  "Using this utility on a phone or tablet is not supported.": "Использование этой утилиты на телефоне или планшете не поддерживается.",
  "VCM Left Barcode": "Штрих-код левого VCM",
  "VCM Right Barcode": "Штрих-код правого VCM",
  "Values": "Значения",
  "Venom FW Version": "Версия прошивки Venom",
  "Version": "Версия",
  "Watch the controller lights change colors, the player lights animate, and the mute button flash.": "Наблюдайте, как меняются цвета огней контроллера, анимируются индикаторы игроков и мигает кнопка отключения звука.",
  "We are not responsible for any damage caused by attempting this modification.": "Мы не несём ответственности за любой ущерб, вызванный попыткой этой модификации.",
  "Welcome": "Добро пожаловать",
  "Welcome to the Calibration GUI": "Добро пожаловать в графический интерфейс калибровки",
  "Welcome to the F.A.Q. section! Below, you'll find answers to some of the most commonly asked questions about this website. If you have any other inquiries or need further assistance, feel free to reach out to me directly. Your feedback and questions are always welcome!": "Добро пожаловать в раздел Ч.З.В.! Ниже вы найдёте ответы на некоторые из наиболее часто задаваемых вопросов об этом сайте. Если у вас есть другие вопросы или вам нужна дополнительная помощь, не стесняйтесь обращаться ко мне напрямую. Ваши отзывы и вопросы всегда приветствуются!",
  "Welcome to the stick center-calibration wizard!": "Добро пожаловать в мастер калибровки центра стиков!",
  "What development is in plan?": "Какое развитие планируется?",
  "When the sticks are back in the center, press <b>Continue</b>.": "Когда стики вернутся в центр, нажмите <b>Продолжить</b>.",
  "While holding the stick to be adjusted straight up/down/left/right, make adjustments until you see lightblue sectors in all four directions after circling the stick both left and right. Then use the": "Удерживая стик, который нужно отрегулировать, прямо вверх/вниз/влево/вправо, вносите корректировки, пока не увидите светло-голубые сектора во всех четырёх направлениях после вращения стика как влево, так и вправо. Затем используйте",
  "While the primary focus of this research wasn't initially centered on recalibration, it became apparent that a service offering this capability could greatly benefit numerous individuals. And thus, here we are.": "Хотя первоначально основное внимание в этом исследовании не было сосредоточено на перекалибровке, стало очевидно, что сервис, предлагающий такую возможность, может принести большую пользу многим людям. И вот мы здесь.",
  "Wiggle the USB cable to see if the controller disconnects.": "Пошевелите USB-кабель, чтобы проверить, отключается ли контроллер.",
  "XBox Controllers": "Контроллеры XBox",
  "Yes, if you tick the checkbox \"Write changes permanently in the controller\". In that case, the calibration is flashed directly in the controller firmware. This ensures that it remains in place regardless of the console it's connected to.": "Да, если вы отметите галочку \"Записать изменения навсегда в контроллере\". В этом случае калибровка прошивается напрямую в прошивку контроллера. Это гарантирует, что она останется на месте независимо от консоли, к которой он подключён.",
  "Yes, only DualShock4 at the moment. This happened because I accidentally purchased some clones, spent time identifying the differences and added this functionality to prevent future deception.": "Да, только DualShock4 на данный момент. Это произошло потому, что я случайно купил несколько клонов, потратил время на выявление различий и добавил эту функцию, чтобы предотвратить обман в будущем.",
  "Yes. Simply do another permanent calibration.": "Да. Просто сделайте другую постоянную калибровку.",
  "You can do this in two ways:": "Вы можете сделать это двумя способами:",
  "You have to rotate the joysticks before you press \"Done\".": "Вы должны вращать джойстики перед нажатием \"Готово\".",
  "You should save your changes, or reboot the controller to revert back to the previous state.": "Вам следует сохранить изменения или перезагрузить контроллер, чтобы вернуться к предыдущему состоянию.",
  "buy me a coffee": "купить мне кофе",
  "clone": "клон",
  "donation": "пожертвование",
  "error": "ошибка",
  "failed": "неудачно",
  "here": "здесь",
  "hide": "скрыть",
  "locked": "заблокировано",
  "original": "оригинал",
  "passed": "успешно",
  "serial number": "серийный номер",
  "skipped": "пропущено",
  "tests completed": "тестов завершено",
  "this research": "это исследование",
  "to increase the non-circularity.": "чтобы увеличить неокруглость.",
  "to support my late-night caffeine-fueled reverse-engineering efforts.": "чтобы поддержать мои поздние ночи, подпитываемые кофеином усилия по реверс-инжинирингу.",
  "unknown": "неизвестно",
  "unlocked": "разблокировано",
  "": ""
}